Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_post_primary_school/junior_cycle.html.txt.tmx
Source language: en
Languages: ga

source: The Junior Cycle covers the first three years of secondary school. Children begin their second-level education around the age of 12 or 13
ga: Déantar freastal ar dhaltaí idir 12 leis an tSraith Shóisearach agus is iondúil go seasann daltaí an scrúdú agus iad 15 nó 16 bliana d’aois agus trí bliana d’oideachas iar-bhunscoile faighte acu

source: The Junior Certificate examination is held at the end of the Junior Cycle in post-primary schools and students normally sit the exam at the age of 15 or 16
ga: Reáchtáltar scrúdú an Teastais Shóisearaigh ag deireadh na Sraithe Sóisearaí i scoileanna iar-bhunscoile

source: Twenty-six subjects are currently available but not all schools offer them
ga: Tá sé ábhar agus fiche ar fáil faoi láthair ach ní bhíonn siad ar fad ar fáil i ngach scoil

source: You can view the Junior Cycle syllabus and curriculum information here
ga: Tá eolas faoi shiollabas agus curaclam na n-ábhar ar fáil

source: All students must follow courses in Irish (except where that student is exempt from studying Irish), English, mathematics and civic, social and political education
ga: Ní mór do gach dalta cúrsaí a leanacht sa Ghaeilge (ach amháin i gcás díolúine), sa Bhéarla, sa Mhatamaitic agus san Oideachas Saoránaíoch, Sóisialta agus Polaitiúil

source: There may be other compulsory subjects, depending on the type of school
ga: D’fhéadfadh go mbeadh ábhair éigeantacha eile i gceist ag brath ar chineál na scoile

source: The Junior Certificate School Programme
ga: Clár Scoile an Teastais Shóisearaigh

source: The Junior Certificate School Programme (JCSP) has been designed to help young people who are at risk of leaving school early and who would benefit from special support when they are working towards the Junior Certificate
ga: Leagadh amach Clár Scoile an Teastais Shóisearaigh d’fhonn cuidiú le daoine óga a bheadh i mbaol an scoil a fhágáil go luath agus a mbainfeadh tairbhe as cúnamh speisialta agus iad ag obair leis an Teastas Sóisearach a bhaint amach

source: Schools that offer the programme are given extra resources in order to facilitate teachers to develop a team approach to supporting the students
ga: Bíonn acmhainní breise ag scoileanna a thairgíonn an clár d’fhonn cuidiú le múinteoirí cur chuige an mheithil a chothú maidir le cúnamh a thabhairt do na daltaí

source: All students participating in the Junior Certificate School Programme must be entered for the Junior Certificate examination
ga: Leanann daltaí atá ag seasamh Clár Scoile an Teastais Shóisearaigh gnáthshiollabas an Teastais Shóisearaigh

source: All JCSP students are entitled to a profile - this is an individualised record of their achievement
ga: Ní mór gach dalta atá ag glacadh páirt i Clár Scoile an Teastais Shóisearaigh a chur isteach ar scrúdú an Teastais Shóisearaigh agus tá gach dalta a ndearnadh próifíl air i dteideal próifíl a fháil, tuairisc faoi leith ar a bhfuil bainte amach ag an dalta sin

source: This profile is in addition to the Junior Certificate
ga: Sa bhreis ar an Teastas Sóisearach an phróifíl sin

source: A review of the JCSP will take place in 2014
ga: Beidh athbhreithniú ar an Clár Scoile an Teastais Shóisearaigh ann i 2014
